# ================= данные =================

CHILDREN_OF_LIGHT = {
    "Остров рассвета": {
        "total": 10,
        "areas": {
            "Пустыня": 5,
            "Пещера бабочек": 1,
            "Пещера пророчеств": 4,
        },
    },
    "Полуденная прерия": {
        "total": 24,
        "areas": {
            "Поля бабочек": 3,
            "Птичья деревня": 3,
            "Головоломка на 8 игроков": 1,
            "Храм Полуденной прерии": 2,
            "Пещера": 2,
            "Степные вершины": 3,
            "Птичье гнездо": 2,
            "Острова укрытия": 8,
        },
    },
    "Тайный лес": {
        "total": 21,
        "areas": {
            "Поляна": 2,
            "Ручей": 4,
            "Сломанный мост": 3,
            "Конец леса": 1,
            "Солнечный лес": 2,
            "Театр Синей птицы": 1,
            "Подземная пещера": 4,
            "Домик на дереве": 2,
            "Пути ветра": 2,
        },
    },
    "Долина триумфа": {
        "total": 17,
        "areas": {
            "Каток": 3,
            "Скользящая гонка": 1,
            "Цитадель": 2,
            "Летящая гонка": 2,
            "Перед колизеем": 1,
            "Колизей": 1,
            "Храм Долины триумфа": 1,
            "Деревушка Мечтаний": 3,
            "Долина Отшельника": 2,
            "Деревенский театр": 1,
        },
    },
    "Золотая пустошь": {
        "total": 18,
        "areas": {
            "Разрушенный храм": 2,
            "Кладбище": 6,
            "Поле битвы": 2,
            "Храм Золотой пустоши": 1,
            "Остров сокровищ": 2,
            "Забытый ковчег": 2,
            "Кораблекрушение": 3,
        },
    },
    "Хранилище знаний": {
        "total": 16,
        "areas": {
            "Первый этаж": 1,
            "Третий этаж": 1,
            "Четвёртый этаж": 2,
            "Пятый этаж": 1,
            "Шестой этаж": 1,
            "Архив": 2,
            "Защищённый тайник": 1,
            "Звёздная пустыня": 3,
            "Лунный оазис": 3,
            "Мумидол": 1,
        },
    },
    "Сердце Эдема": {
        "total": 10,
        "areas": {
            "Первая локация": 1,
            "Четвёртая локация": 9,
        },
    },
    "Орбита":{
        "total": 1
    },
    "Воспоминания осколков": {
        "total": 6,
        "areas": {
            "Воспоминание краба": 1,
            "Воспоминание медузы": 1,
            "Воспоминание дракона": 1,
            "Воспоминание кита": 1,
            "Воспоминание старейшин": 1,
            "Воспоминание манты": 1,
        },
    }
}

def count_all_children() -> int:
    """
    Считает общее количество детей света
    """
    return sum(location["total"] for location in CHILDREN_OF_LIGHT.values())

def format_children_list() -> str:
    """
    Формирует список локаций и детей света
    Поддерживает пустые areas
    """
    lines: list[str] = []

    for location, data in CHILDREN_OF_LIGHT.items():
        lines.append(f"🌍 {location} — {data['total']}")

        for area, count in data.get("areas", {}).items():
            lines.append(f"  └ {area}: {count}")

        lines.append("")

    total = count_all_children()
    lines.append(f"✨ Всего детей света: {total}")

    return "\n".join(lines)